app/views/restaurants/index.html.erb

    <h3>Reviews for <%= restaurant.name %>></h3>
      <% if restaurant.reviews.any? %>
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT 1  [["restaurant_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]