app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Nandos"], ["user_id", 1], ["created_at", "2015-11-25 16:17:04.607150"], ["updated_at", "2015-11-25 16:17:04.607150"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save